{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "=": 29,
      "?": 30,
      "`": 31,
      "a": 32,
      "b": 33,
      "c": 34,
      "d": 35,
      "e": 36,
      "f": 37,
      "g": 38,
      "h": 39,
      "i": 40,
      "j": 41,
      "k": 42,
      "l": 43,
      "m": 44,
      "n": 45,
      "o": 46,
      "p": 47,
      "q": 48,
      "r": 49,
      "s": 50,
      "t": 51,
      "u": 52,
      "v": 53,
      "w": 54,
      "x": 55,
      "y": 56,
      "z": 57,
      "£": 58,
      "¦": 59,
      "«": 60,
      "¬": 61,
      "®": 62,
      "¼": 63,
      "##u": 64,
      "##t": 65,
      "##s": 66,
      "##i": 67,
      "##d": 68,
      "##e": 69,
      "##6": 70,
      "##0": 71,
      "##r": 72,
      "##f": 73,
      "##c": 74,
      "##a": 75,
      "##o": 76,
      "##n": 77,
      "##v": 78,
      "##b": 79,
      "##l": 80,
      "##4": 81,
      "##3": 82,
      "##8": 83,
      "##m": 84,
      "##y": 85,
      "##5": 86,
      "##p": 87,
      "##h": 88,
      "##k": 89,
      "##g": 90,
      "##2": 91,
      "##9": 92,
      "##x": 93,
      "##7": 94,
      "##1": 95,
      "##w": 96,
      "##z": 97,
      "##q": 98,
      "##j": 99,
      "##er": 100,
      "th": 101,
      "##in": 102,
      "the": 103,
      "##on": 104,
      "##es": 105,
      "##an": 106,
      "in": 107,
      "##or": 108,
      "##ar": 109,
      "##ed": 110,
      "##en": 111,
      "##at": 112,
      "##ro": 113,
      "##al": 114,
      "of": 115,
      "an": 116,
      "##ing": 117,
      "##ion": 118,
      "to": 119,
      "##ur": 120,
      "##it": 121,
      "##il": 122,
      "and": 123,
      "##om": 124,
      "##as": 125,
      "##is": 126,
      "##ct": 127,
      "##ic": 128,
      "##el": 129,
      "##et": 130,
      "##ent": 131,
      "com": 132,
      "20": 133,
      "##st": 134,
      "##re": 135,
      "pro": 136,
      "##ill": 137,
      "comp": 138,
      "eur": 139,
      "##id": 140,
      "for": 141,
      "200": 142,
      "##ec": 143,
      "##ation": 144,
      "##ut": 145,
      "it": 146,
      "fin": 147,
      "##ol": 148,
      "st": 149,
      "##em": 150,
      "is": 151,
      "compan": 152,
      "##per": 153,
      "on": 154,
      "con": 155,
      "##un": 156,
      "be": 157,
      "##us": 158,
      "##ter": 159,
      "##iv": 160,
      "sa": 161,
      "will": 162,
      "company": 163,
      "##ir": 164,
      "##and": 165,
      "##ers": 166,
      "##rom": 167,
      "from": 168,
      "##ish": 169,
      "##le": 170,
      "sh": 171,
      "as": 172,
      "##os": 173,
      "##th": 174,
      "re": 175,
      "##ig": 176,
      "##ul": 177,
      "##ch": 178,
      "##est": 179,
      "##ia": 180,
      "##ad": 181,
      "##ay": 182,
      "its": 183,
      "##ess": 184,
      "##ith": 185,
      "##ow": 186,
      "ex": 187,
      "##ment": 188,
      "with": 189,
      "per": 190,
      "##ly": 191,
      "##uct": 192,
      "ne": 193,
      "has": 194,
      "##pp": 195,
      "##im": 196,
      "oper": 197,
      "al": 198,
      "finn": 199,
      "##od": 200,
      "##ce": 201,
      "##ect": 202,
      "by": 203,
      "su": 204,
      "##ding": 205,
      "sal": 206,
      "said": 207,
      "at": 208,
      "net": 209,
      "inc": 210,
      "##ot": 211,
      "##ra": 212,
      "##ies": 213,
      "finnish": 214,
      "mar": 215,
      "##ear": 216,
      "en": 217,
      "mn": 218,
      "##por": 219,
      "##illion": 220,
      "##are": 221,
      "wh": 222,
      "ma": 223,
      "pl": 224,
      "##ev": 225,
      "gro": 226,
      "##uar": 227,
      "prof": 228,
      "sales": 229,
      "year": 230,
      "million": 231,
      "##ust": 232,
      "##um": 233,
      "##oc": 234,
      "that": 235,
      "profit": 236,
      "##ial": 237,
      "##ity": 238,
      "##ts": 239,
      "co": 240,
      "##00": 241,
      "ac": 242,
      "##erv": 243,
      "##ap": 244,
      "cont": 245,
      "pr": 246,
      "was": 247,
      "##ab": 248,
      "new": 249,
      "##ating": 250,
      "prod": 251,
      "##ement": 252,
      "ch": 253,
      "##art": 254,
      "are": 255,
      "serv": 256,
      "##ag": 257,
      "##land": 258,
      "##qu": 259,
      "##up": 260,
      "un": 261,
      "##ber": 262,
      "##ate": 263,
      "##op": 264,
      "##av": 265,
      "##ased": 266,
      "201": 267,
      "man": 268,
      "##ations": 269,
      "##ket": 270,
      "##ac": 271,
      "finland": 272,
      "cor": 273,
      "us": 274,
      "##mp": 275,
      "servic": 276,
      "or": 277,
      "##ine": 278,
      "hel": 279,
      "oy": 280,
      "##lo": 281,
      "##ki": 282,
      "eu": 283,
      "market": 284,
      "group": 285,
      "product": 286,
      "euro": 287,
      "##so": 288,
      "##ip": 289,
      "##ver": 290,
      "##ell": 291,
      "##ok": 292,
      "##uarter": 293,
      "##am": 294,
      "##ated": 295,
      "##ions": 296,
      "##ist": 297,
      "##ant": 298,
      "2009": 299,
      "share": 300,
      "##act": 301,
      "##ln": 302,
      "##all": 303,
      "operating": 304,
      "up": 305,
      "2008": 306,
      "bus": 307,
      "##ive": 308,
      "res": 309,
      "##iness": 310,
      "##ue": 311,
      "mln": 312,
      "business": 313,
      "##ain": 314,
      "inv": 315,
      "se": 316,
      "##oun": 317,
      "##igh": 318,
      "tr": 319,
      "##iod": 320,
      "##der": 321,
      "##ase": 322,
      "ad": 323,
      "dev": 324,
      "quarter": 325,
      "period": 326,
      "##day": 327,
      "ind": 328,
      "##ard": 329,
      "exp": 330,
      "mo": 331,
      "##ore": 332,
      "2007": 333,
      "##ign": 334,
      "off": 335,
      "ab": 336,
      "ag": 337,
      "##out": 338,
      "##og": 339,
      "##ans": 340,
      "tot": 341,
      "2010": 342,
      "bo": 343,
      "##ast": 344,
      "##ff": 345,
      "##ak": 346,
      "##ich": 347,
      "##ave": 348,
      "##ri": 349,
      "##arg": 350,
      "##ile": 351,
      "##lu": 352,
      "oyj": 353,
      "sol": 354,
      "cap": 355,
      "fir": 356,
      "##ech": 357,
      "dec": 358,
      "incre": 359,
      "app": 360,
      "##ang": 361,
      "we": 362,
      "##ank": 363,
      "##ice": 364,
      "##ther": 365,
      "also": 366,
      "000": 367,
      "bu": 368,
      "##res": 369,
      "services": 370,
      "invest": 371,
      "nor": 372,
      "which": 373,
      "have": 374,
      "##ork": 375,
      "##port": 376,
      "##ere": 377,
      "##ure": 378,
      "##pt": 379,
      "acc": 380,
      "##io": 381,
      "##ruct": 382,
      "##li": 383,
      "##ug": 384,
      "##anc": 385,
      "devel": 386,
      "part": 387,
      "##ors": 388,
      "##ares": 389,
      "am": 390,
      "##ract": 391,
      "est": 392,
      "de": 393,
      "he": 394,
      "rec": 395,
      "tech": 396,
      "shares": 397,
      "##ry": 398,
      "##ance": 399,
      "##ition": 400,
      "first": 401,
      "##ire": 402,
      "inclu": 403,
      "total": 404,
      "sp": 405,
      "techn": 406,
      "this": 407,
      "##if": 408,
      "2006": 409,
      "##ose": 410,
      "##ail": 411,
      "me": 412,
      "inter": 413,
      "sy": 414,
      "out": 415,
      "ann": 416,
      "contract": 417,
      "##ond": 418,
      "##ome": 419,
      "prov": 420,
      "##able": 421,
      "develop": 422,
      "##ember": 423,
      "##ult": 424,
      "##ock": 425,
      "##oss": 426,
      "##ical": 427,
      "cons": 428,
      "sec": 429,
      "hels": 430,
      "solut": 431,
      "##bs": 432,
      "int": 433,
      "supp": 434,
      "##inki": 435,
      "helsinki": 436,
      "comm": 437,
      "le": 438,
      "tel": 439,
      "been": 440,
      "10": 441,
      "compar": 442,
      "manag": 443,
      "mak": 444,
      "##ual": 445,
      "financ": 446,
      "provid": 447,
      "bank": 448,
      "##our": 449,
      "##end": 450,
      "agre": 451,
      "ear": 452,
      "mon": 453,
      "##ov": 454,
      "indust": 455,
      "rel": 456,
      "##man": 457,
      "##olog": 458,
      "loss": 459,
      "##ning": 460,
      "##loy": 461,
      "##ens": 462,
      "str": 463,
      "br": 464,
      "acqu": 465,
      "##fact": 466,
      "corpor": 467,
      "##ong": 468,
      "##ely": 469,
      "buil": 470,
      "emp": 471,
      "##ufact": 472,
      "manufact": 473,
      "nok": 474,
      "##int": 475,
      "unit": 476,
      "about": 477,
      "technolog": 478,
      "cust": 479,
      "##ub": 480,
      "##for": 481,
      "##pon": 482,
      "stock": 483,
      "po": 484,
      "##ood": 485,
      "##uring": 486,
      "custom": 487,
      "today": 488,
      "operations": 489,
      "compared": 490,
      "##ian": 491,
      "mob": 492,
      "ph": 493,
      "##ject": 494,
      "employ": 495,
      "met": 496,
      "sign": 497,
      "##cent": 498,
      "##ital": 499,
      "##ik": 500,
      "##ort": 501,
      "##stem": 502,
      "##uss": 503,
      "pa": 504,
      "pre": 505,
      "trans": 506,
      "expect": 507,
      "system": 508,
      "af": 509,
      "ele": 510,
      "##wn": 511,
      "financial": 512,
      "nokia": 513,
      "##one": 514,
      "##own": 515,
      "##uary": 516,
      "mobile": 517,
      "val": 518,
      "##ware": 519,
      "report": 520,
      "del": 521,
      "accor": 522,
      "ra": 523,
      "##ary": 524,
      "##und": 525,
      "production": 526,
      "##ange": 527,
      "investment": 528,
      "based": 529,
      "percent": 530,
      "##form": 531,
      "not": 532,
      "##ek": 533,
      "sw": 534,
      "cent": 535,
      "products": 536,
      "##ery": 537,
      "corporation": 538,
      "corres": 539,
      "all": 540,
      "includ": 541,
      "russ": 542,
      "project": 543,
      "subs": 544,
      "##lier": 545,
      "##struct": 546,
      "agreement": 547,
      "according": 548,
      "other": 549,
      "so": 550,
      "were": 551,
      "##ib": 552,
      "companies": 553,
      "##ates": 554,
      "##ugh": 555,
      "imp": 556,
      "own": 557,
      "##eo": 558,
      "##ft": 559,
      "##ced": 560,
      "appro": 561,
      "technology": 562,
      "12": 563,
      "fe": 564,
      "##ponding": 565,
      "corresponding": 566,
      "##cess": 567,
      "##ics": 568,
      "construct": 569,
      "plant": 570,
      "add": 571,
      "##erm": 572,
      "than": 573,
      "service": 574,
      "15": 575,
      "equ": 576,
      "##se": 577,
      "solutions": 578,
      "month": 579,
      "elect": 580,
      "deliv": 581,
      "cl": 582,
      "div": 583,
      "our": 584,
      "sc": 585,
      "##iz": 586,
      "##ility": 587,
      "##uld": 588,
      "##ace": 589,
      "##1v": 590,
      "##work": 591,
      "19": 592,
      "well": 593,
      "##urr": 594,
      "one": 595,
      "capital": 596,
      "##ld": 597,
      "##erg": 598,
      "construction": 599,
      "dire": 600,
      "jan": 601,
      "tw": 602,
      "##ount": 603,
      "direct": 604,
      "##ities": 605,
      "eur1": 606,
      "order": 607,
      "increased": 608,
      "##ubl": 609,
      "30": 610,
      "down": 611,
      "##ron": 612,
      "##ater": 613,
      "2005": 614,
      "##ight": 615,
      "11": 616,
      "wor": 617,
      "end": 618,
      "##rib": 619,
      "nord": 620,
      "over": 621,
      "network": 622,
      "under": 623,
      "more": 624,
      "##ould": 625,
      "##urn": 626,
      "##ade": 627,
      "##ass": 628,
      "start": 629,
      "##ower": 630,
      "act": 631,
      "their": 632,
      "reg": 633,
      "plan": 634,
      "increase": 635,
      "customers": 636,
      "swed": 637,
      "rose": 638,
      "term": 639,
      "paper": 640,
      "value": 641,
      "high": 642,
      "loc": 643,
      "##ise": 644,
      "gen": 645,
      "pct": 646,
      "##uk": 647,
      "med": 648,
      "om": 649,
      "work": 650,
      "##ven": 651,
      "##ence": 652,
      "##ata": 653,
      "grow": 654,
      "##ack": 655,
      "board": 656,
      "##ake": 657,
      "des": 658,
      "##ering": 659,
      "sam": 660,
      "contin": 661,
      "second": 662,
      "14": 663,
      "ret": 664,
      "some": 665,
      "##pr": 666,
      "process": 667,
      "coun": 668,
      "building": 669,
      "##isc": 670,
      "##ever": 671,
      "hand": 672,
      "##hol": 673,
      "##xim": 674,
      "announ": 675,
      "after": 676,
      "two": 677,
      "omx": 678,
      "25": 679,
      "##ders": 680,
      "##air": 681,
      "rep": 682,
      "sept": 683,
      "january": 684,
      "would": 685,
      "##ries": 686,
      "##ures": 687,
      "##ational": 688,
      "news": 689,
      "can": 690,
      "larg": 691,
      "##let": 692,
      "##ys": 693,
      "##ark": 694,
      "##eng": 695,
      "##oll": 696,
      "usd": 697,
      "development": 698,
      "pres": 699,
      "result": 700,
      "decre": 701,
      "employe": 702,
      "##ix": 703,
      "##enc": 704,
      "##ices": 705,
      "##unic": 706,
      "##ram": 707,
      "##ipment": 708,
      "deal": 709,
      "industry": 710,
      "gener": 711,
      "##ision": 712,
      "estim": 713,
      "intern": 714,
      "management": 715,
      "13": 716,
      "thir": 717,
      "eng": 718,
      "earlier": 719,
      "september": 720,
      "##ax": 721,
      "##ous": 722,
      "##ko": 723,
      "##ide": 724,
      "##ious": 725,
      "russia": 726,
      "aut": 727,
      "jo": 728,
      "pe": 729,
      "tim": 730,
      "##ports": 731,
      "equipment": 732,
      "third": 733,
      "la": 734,
      "##mn": 735,
      "##ines": 736,
      "mach": 737,
      "design": 738,
      "last": 739,
      "tra": 740,
      "##pe": 741,
      "expected": 742,
      "car": 743,
      "dist": 744,
      "hol": 745,
      "real": 746,
      "head": 747,
      "soft": 748,
      "deliver": 749,
      "count": 750,
      "publ": 751,
      "##ie": 752,
      "##ately": 753,
      "##ite": 754,
      "stor": 755,
      "lead": 756,
      "##over": 757,
      "##ve": 758,
      "##we": 759,
      "##ree": 760,
      "ass": 761,
      "##age": 762,
      "2011": 763,
      "into": 764,
      "ar": 765,
      "curr": 766,
      "##fore": 767,
      "##ward": 768,
      "annual": 769,
      "acquis": 770,
      "decreased": 771,
      "16": 772,
      "cr": 773,
      "ceo": 774,
      "glo": 775,
      "had": 776,
      "lo": 777,
      "##fer": 778,
      "##oper": 779,
      "same": 780,
      "glob": 781,
      "el": 782,
      "eff": 783,
      "fr": 784,
      "oct": 785,
      "rem": 786,
      "##ps": 787,
      "complet": 788,
      "cost": 789,
      "maker": 790,
      "employees": 791,
      "bet": 792,
      "fac": 793,
      "num": 794,
      "pos": 795,
      "iss": 796,
      "plc": 797,
      "price": 798,
      "##abl": 799,
      "signed": 800,
      "##ribut": 801,
      "media": 802,
      "software": 803,
      "##te": 804,
      "##ator": 805,
      "##ecom": 806,
      "##ateg": 807,
      "18": 808,
      "how": 809,
      "no": 810,
      "pers": 811,
      "##ht": 812,
      "##rough": 813,
      "##ents": 814,
      "neg": 815,
      "opt": 816,
      "red": 817,
      "##ina": 818,
      "##ons": 819,
      "##arm": 820,
      "##ene": 821,
      "ste": 822,
      "systems": 823,
      "electron": 824,
      "global": 825,
      "bas": 826,
      "##ud": 827,
      "##onn": 828,
      "europe": 829,
      "##ific": 830,
      "world": 831,
      "sell": 832,
      "##ka": 833,
      "##osed": 834,
      "while": 835,
      "##alled": 836,
      "both": 837,
      "announced": 838,
      "sect": 839,
      "##ach": 840,
      "##ost": 841,
      "##alt": 842,
      "##idi": 843,
      "##change": 844,
      "markets": 845,
      "data": 846,
      "##mm": 847,
      "exchange": 848,
      "amount": 849,
      "including": 850,
      "approxim": 851,
      "number": 852,
      "approximately": 853,
      "do": 854,
      "four": 855,
      "through": 856,
      "inst": 857,
      "##ative": 858,
      "##ala": 859,
      "##ights": 860,
      "brand": 861,
      "current": 862,
      "lt": 863,
      "inform": 864,
      "##iss": 865,
      "##ident": 866,
      "area": 867,
      "##ople": 868,
      "rele": 869,
      "people": 870,
      "billion": 871,
      "ka": 872,
      "line": 873,
      "may": 874,
      "now": 875,
      "##ues": 876,
      "##uuk": 877,
      "##ks": 878,
      "##ments": 879,
      "manufactur": 880,
      "prev": 881,
      "growth": 882,
      "engine": 883,
      "17": 884,
      "jun": 885,
      "mod": 886,
      "##ex": 887,
      "anal": 888,
      "##els": 889,
      "##ecial": 890,
      "impro": 891,
      "acquisition": 892,
      "ltd": 893,
      "##uukki": 894,
      "long": 895,
      "turn": 896,
      "va": 897,
      "##ric": 898,
      "##ola": 899,
      "reven": 900,
      "most": 901,
      "strateg": 902,
      "previous": 903,
      "nov": 904,
      "##uc": 905,
      "##ober": 906,
      "asp": 907,
      "fl": 908,
      "sm": 909,
      "##ey": 910,
      "##lic": 911,
      "##inen": 912,
      "##ars": 913,
      "##pert": 914,
      "euros": 915,
      "subsc": 916,
      "subsidi": 917,
      "months": 918,
      "distribut": 919,
      "october": 920,
      "35": 921,
      "fur": 922,
      "ful": 923,
      "gl": 924,
      "##ued": 925,
      "##ved": 926,
      "##gin": 927,
      "##alf": 928,
      "eur0": 929,
      "applic": 930,
      "amer": 931,
      "countries": 932,
      "disc": 933,
      "lat": 934,
      "##ma": 935,
      "stake": 936,
      "sharehol": 937,
      "supply": 938,
      "telecom": 939,
      "transact": 940,
      "feb": 941,
      "addition": 942,
      "tal": 943,
      "##sp": 944,
      "##rol": 945,
      "march": 946,
      "use": 947,
      "consum": 948,
      "communic": 949,
      "time": 950,
      "information": 951,
      "june": 952,
      "further": 953,
      "50": 954,
      "gr": 955,
      "non": 956,
      "##line": 957,
      "##20": 958,
      "##ory": 959,
      "before": 960,
      "manufacturing": 961,
      "retail": 962,
      "##ween": 963,
      "between": 964,
      "however": 965,
      "av": 966,
      "apr": 967,
      "during": 968,
      "half": 969,
      "pur": 970,
      "port": 971,
      "targ": 972,
      "##gr": 973,
      "##ila": 974,
      "##lex": 975,
      "ext": 976,
      "##ote": 977,
      "energ": 978,
      "buy": 979,
      "remain": 980,
      "steel": 981,
      "target": 982,
      "fell": 983,
      "power": 984,
      "##ea": 985,
      "these": 986,
      "##oti": 987,
      "##otec": 988,
      "includes": 989,
      "largest": 990,
      "negoti": 991,
      "engineering": 992,
      "april": 993,
      "23": 994,
      "21": 995,
      "cas": 996,
      "cut": 997,
      "oil": 998,
      "vol": 999,
      "##her": 1000,
      "##ined": 1001,
      "##inery": 1002,
      "##ators": 1003,
      "compet": 1004,
      "##este": 1005,
      "partn": 1006,
      "solution": 1007,
      "reported": 1008,
      "##ible": 1009,
      "gre": 1010,
      "##con": 1011,
      "##la": 1012,
      "they": 1013,
      "##urg": 1014,
      "dep": 1015,
      "acquir": 1016,
      "nordic": 1017,
      "swedish": 1018,
      "40": 1019,
      "aim": 1020,
      "made": 1021,
      "##ss": 1022,
      "##ling": 1023,
      "##gan": 1024,
      "##ished": 1025,
      "capac": 1026,
      "meas": 1027,
      "##nings": 1028,
      "release": 1029,
      "energy": 1030,
      "24": 1031,
      "bro": 1032,
      "foll": 1033,
      "lif": 1034,
      "##ria": 1035,
      "special": 1036,
      "estimated": 1037,
      "subsidiary": 1038,
      "bec": 1039,
      "balt": 1040,
      "food": 1041,
      "rights": 1042,
      "san": 1043,
      "three": 1044,
      "##ady": 1045,
      "##pping": 1046,
      "years": 1047,
      "china": 1048,
      "##ound": 1049,
      "totalled": 1050,
      "earnings": 1051,
      "signific": 1052,
      "international": 1053,
      "follow": 1054,
      "100": 1055,
      "29": 1056,
      "aug": 1057,
      "carg": 1058,
      "mill": 1059,
      "mater": 1060,
      "nine": 1061,
      "ty": 1062,
      "##rial": 1063,
      "##ari": 1064,
      "conc": 1065,
      "expand": 1066,
      "office": 1067,
      "industrial": 1068,
      "include": 1069,
      "electronics": 1070,
      "capacity": 1071,
      "significant": 1072,
      "dem": 1073,
      "lay": 1074,
      "min": 1075,
      "##min": 1076,
      "##round": 1077,
      "eur2": 1078,
      "form": 1079,
      "control": 1080,
      "expects": 1081,
      "activ": 1082,
      "transaction": 1083,
      "material": 1084,
      "26": 1085,
      "dr": 1086,
      "fund": 1087,
      "op": 1088,
      "pet": 1089,
      "sit": 1090,
      "sch": 1091,
      "##ting": 1092,
      "##unch": 1093,
      "sale": 1094,
      "main": 1095,
      "totaled": 1096,
      "manufacturer": 1097,
      "22": 1098,
      "det": 1099,
      "dig": 1100,
      "foc": 1101,
      "go": 1102,
      "good": 1103,
      "pat": 1104,
      "pay": 1105,
      "##led": 1106,
      "##jor": 1107,
      "##ind": 1108,
      "##ester": 1109,
      "##ord": 1110,
      "##ings": 1111,
      "##isk": 1112,
      "secur": 1113,
      "##ength": 1114,
      "machinery": 1115,
      "facility": 1116,
      "revenue": 1117,
      "cash": 1118,
      "focus": 1119,
      "air": 1120,
      "city": 1121,
      "day": 1122,
      "pol": 1123,
      "##ph": 1124,
      "2004": 1125,
      "says": 1126,
      "whol": 1127,
      "##ame": 1128,
      "trad": 1129,
      "rece": 1130,
      "local": 1131,
      "president": 1132,
      "sector": 1133,
      "americ": 1134,
      "negotiations": 1135,
      "volum": 1136,
      "august": 1137,
      "eps": 1138,
      "lower": 1139,
      "ro": 1140,
      "##da": 1141,
      "##ral": 1142,
      "##ruary": 1143,
      "##ge": 1144,
      "##omp": 1145,
      "##pped": 1146,
      "enter": 1147,
      "when": 1148,
      "major": 1149,
      "##ructure": 1150,
      "meet": 1151,
      "units": 1152,
      "pharm": 1153,
      "transfer": 1154,
      "raut": 1155,
      "nordea": 1156,
      "sweden": 1157,
      "launch": 1158,
      "february": 1159,
      "purch": 1160,
      "baltic": 1161,
      "33": 1162,
      "bel": 1163,
      "lit": 1164,
      "sin": 1165,
      "ti": 1166,
      "##hip": 1167,
      "ins": 1168,
      "propert": 1169,
      "forest": 1170,
      "stat": 1171,
      "sav": 1172,
      "such": 1173,
      "north": 1174,
      "related": 1175,
      "divid": 1176,
      "##ouse": 1177,
      "holding": 1178,
      "basware": 1179,
      "27": 1180,
      "award": 1181,
      "eb": 1182,
      "jul": 1183,
      "li": 1184,
      "ruukki": 1185,
      "te": 1186,
      "tax": 1187,
      "##burg": 1188,
      "##gram": 1189,
      "##quarter": 1190,
      "##erc": 1191,
      "##ones": 1192,
      "##anes": 1193,
      "##ising": 1194,
      "prop": 1195,
      "program": 1196,
      "compon": 1197,
      "##ives": 1198,
      "ent": 1199,
      "offer": 1200,
      "establ": 1201,
      "interest": 1202,
      "post": 1203,
      "phone": 1204,
      "repres": 1205,
      "##ency": 1206,
      "31": 1207,
      "kn": 1208,
      "lev": 1209,
      "mat": 1210,
      "set": 1211,
      "##uation": 1212,
      "##lement": 1213,
      "##als": 1214,
      "##itive": 1215,
      "##ici": 1216,
      "exc": 1217,
      "cooper": 1218,
      "support": 1219,
      "strength": 1220,
      "headquarter": 1221,
      "stora": 1222,
      "avail": 1223,
      "around": 1224,
      "log": 1225,
      "rest": 1226,
      "sout": 1227,
      "vot": 1228,
      "##xt": 1229,
      "##way": 1230,
      "##ja": 1231,
      "##ister": 1232,
      "comb": 1233,
      "corp": 1234,
      "orders": 1235,
      "upm": 1236,
      "developed": 1237,
      "provider": 1238,
      "projects": 1239,
      "director": 1240,
      "completed": 1241,
      "im": 1242,
      "ky": 1243,
      "##ert": 1244,
      "there": 1245,
      "##itions": 1246,
      "eur3": 1247,
      "##ems": 1248,
      "where": 1249,
      "maint": 1250,
      "adp": 1251,
      "eston": 1252,
      "russian": 1253,
      "division": 1254,
      "networks": 1255,
      "region": 1256,
      "leading": 1257,
      "option": 1258,
      "november": 1259,
      "discl": 1260,
      "sanom": 1261,
      "july": 1262,
      "available": 1263,
      "ah": 1264,
      "due": 1265,
      "qual": 1266,
      "sl": 1267,
      "uk": 1268,
      "won": 1269,
      "##ium": 1270,
      "##cote": 1271,
      "##ne": 1272,
      "##ern": 1273,
      "##ason": 1274,
      "##aster": 1275,
      "##ready": 1276,
      "##iday": 1277,
      "##ecut": 1278,
      "ref": 1279,
      "already": 1280,
      "suom": 1281,
      "env": 1282,
      "enso": 1283,
      "plans": 1284,
      "charg": 1285,
      "supplier": 1286,
      "strong": 1287,
      "directors": 1288,
      "general": 1289,
      "elcote": 1290,
      "shareholders": 1291,
      "elcoteq": 1292,
      "em": 1293,
      "his": 1294,
      "six": 1295,
      "yit": 1296,
      "##iff": 1297,
      "##bers": 1298,
      "##ily": 1299,
      "##ised": 1300,
      "##utical": 1301,
      "perform": 1302,
      "sub": 1303,
      "capman": 1304,
      "center": 1305,
      "added": 1306,
      "##aceutical": 1307,
      "personn": 1308,
      "turnover": 1309,
      "strategy": 1310,
      "distribution": 1311,
      "communications": 1312,
      "since": 1313,
      "dividend": 1314,
      "personnel": 1315,
      "36": 1316,
      "aff": 1317,
      "par": 1318,
      "pul": 1319,
      "pack": 1320,
      "rap": 1321,
      "tak": 1322,
      "##ience": 1323,
      "##fr": 1324,
      "##aff": 1325,
      "##era": 1326,
      "##ining": 1327,
      "##isa": 1328,
      "##ively": 1329,
      "##ump": 1330,
      "press": 1331,
      "agreed": 1332,
      "customer": 1333,
      "continue": 1334,
      "carri": 1335,
      "position": 1336,
      "amounted": 1337,
      "acquired": 1338,
      "pharmaceutical": 1339,
      "insur": 1340,
      "28": 1341,
      "80": 1342,
      "bl": 1343,
      "ger": 1344,
      "mid": 1345,
      "range": 1346,
      "##ration": 1347,
      "##na": 1348,
      "##vi": 1349,
      "##iron": 1350,
      "next": 1351,
      "prices": 1352,
      "produc": 1353,
      "##aging": 1354,
      "resp": 1355,
      "week": 1356,
      "make": 1357,
      "provide": 1358,
      "effect": 1359,
      "effici": 1360,
      "currently": 1361,
      "following": 1362,
      "demand": 1363,
      "represent": 1364,
      "cre": 1365,
      "diff": 1366,
      "esp": 1367,
      "fisk": 1368,
      "list": 1369,
      "tem": 1370,
      "##ga": 1371,
      "##ural": 1372,
      "##ental": 1373,
      "eur4": 1374,
      "##earch": 1375,
      "cover": 1376,
      "firm": 1377,
      "partic": 1378,
      "poh": 1379,
      "scan": 1380,
      "handling": 1381,
      "##ixed": 1382,
      "autom": 1383,
      "issue": 1384,
      "fourth": 1385,
      "analy": 1386,
      "previously": 1387,
      "full": 1388,
      "peters": 1389,
      "security": 1390,
      "awarded": 1391,
      "environ": 1392,
      "fiskars": 1393,
      "45": 1394,
      "fact": 1395,
      "mem": 1396,
      "tik": 1397,
      "##ah": 1398,
      "##aus": 1399,
      "##met": 1400,
      "##edit": 1401,
      "##ilities": 1402,
      "##ick": 1403,
      "exper": 1404,
      "execut": 1405,
      "##ements": 1406,
      "chain": 1407,
      "used": 1408,
      "##mpo": 1409,
      "##ipt": 1410,
      "trade": 1411,
      "developer": 1412,
      "estate": 1413,
      "##ized": 1414,
      "##iew": 1415,
      "credit": 1416,
      "friday": 1417,
      "costs": 1418,
      "grew": 1419,
      "performance": 1420,
      "german": 1421,
      "tempor": 1422,
      "petersburg": 1423,
      "fi": 1424,
      "fun": 1425,
      "kem": 1426,
      "mr": 1427,
      "qu": 1428,
      "tur": 1429,
      "via": 1430,
      "water": 1431,
      "##set": 1432,
      "##ds": 1433,
      "##ript": 1434,
      "##pa": 1435,
      "##pl": 1436,
      "##enance": 1437,
      "##its": 1438,
      "staff": 1439,
      "sampo": 1440,
      "##ular": 1441,
      "##ults": 1442,
      "alma": 1443,
      "print": 1444,
      "chair": 1445,
      "##ama": 1446,
      "results": 1447,
      "december": 1448,
      "commerc": 1449,
      "central": 1450,
      "processing": 1451,
      "joint": 1452,
      "subscript": 1453,
      "situation": 1454,
      "meeting": 1455,
      "headquartered": 1456,
      "maintenance": 1457,
      "quality": 1458,
      "insurance": 1459,
      "commercial": 1460,
      "38": 1461,
      "60": 1462,
      "found": 1463,
      "id": 1464,
      "lem": 1465,
      "pass": 1466,
      "ve": 1467,
      "vers": 1468,
      "##uce": 1469,
      "##ior": 1470,
      "##row": 1471,
      "##strom": 1472,
      "eur5": 1473,
      "stre": 1474,
      "organ": 1475,
      "##istics": 1476,
      "provides": 1477,
      "internet": 1478,
      "asset": 1479,
      "open": 1480,
      "detail": 1481,
      "america": 1482,
      "cooperation": 1483,
      "chairman": 1484,
      "70": 1485,
      "bn": 1486,
      "key": 1487,
      "sim": 1488,
      "sports": 1489,
      "take": 1490,
      "##oice": 1491,
      "##ned": 1492,
      "##vers": 1493,
      "##ke": 1494,
      "##urs": 1495,
      "items": 1496,
      "begin": 1497,
      "##ived": 1498,
      "##thing": 1499,
      "pret": 1500,
      "seg": 1501,
      "##ffic": 1502,
      "account": 1503,
      "recent": 1504,
      "commit": 1505,
      "##ourc": 1506,
      "built": 1507,
      "metso": 1508,
      "owned": 1509,
      "started": 1510,
      "terms": 1511,
      "auth": 1512,
      "traffic": 1513,
      "delivered": 1514,
      "volume": 1515,
      "voting": 1516,
      "sanoma": 1517,
      "pulp": 1518,
      "pohj": 1519,
      "environment": 1520,
      "ev": 1521,
      "fut": 1522,
      "sever": 1523,
      "ww": 1524,
      "war": 1525,
      "##tel": 1526,
      "##sh": 1527,
      "##oo": 1528,
      "##ha": 1529,
      "##ara": 1530,
      "##ises": 1531,
      "store": 1532,
      "##ira": 1533,
      "##ership": 1534,
      "need": 1535,
      "finnair": 1536,
      "summ": 1537,
      "play": 1538,
      "place": 1539,
      "chang": 1540,
      "respon": 1541,
      "##ainen": 1542,
      "access": 1543,
      "##mann": 1544,
      "poy": 1545,
      "implement": 1546,
      "register": 1547,
      "plants": 1548,
      "analys": 1549,
      "aspo": 1550,
      "small": 1551,
      "applications": 1552,
      "measures": 1553,
      "broad": 1554,
      "cargotec": 1555,
      "purchase": 1556,
      "ahl": 1557,
      "affect": 1558,
      "respect": 1559,
      "analyst": 1560,
      "kemira": 1561,
      "pretax": 1562,
      "several": 1563,
      "00": 1564,
      "fixed": 1565,
      "gover": 1566,
      "ok": 1567,
      "pan": 1568,
      "rental": 1569,
      "si": 1570,
      "tre": 1571,
      "tonn": 1572,
      "##uan": 1573,
      "##uced": 1574,
      "##ied": 1575,
      "##iason": 1576,
      "##fil": 1577,
      "init": 1578,
      "ant": 1579,
      "state": 1580,
      "cond": 1581,
      "being": 1582,
      "##iven": 1583,
      "reports": 1584,
      "near": 1585,
      "margin": 1586,
      "enabl": 1587,
      "plat": 1588,
      "##ability": 1589,
      "areas": 1590,
      "marketing": 1591,
      "research": 1592,
      "devices": 1593,
      "offering": 1594,
      "sold": 1595,
      "record": 1596,
      "teliason": 1597,
      "stockmann": 1598,
      "investments": 1599,
      "delivery": 1600,
      "##urring": 1601,
      "worth": 1602,
      "higher": 1603,
      "present": 1604,
      "european": 1605,
      "savings": 1606,
      "component": 1607,
      "level": 1608,
      "strengthen": 1609,
      "differ": 1610,
      "members": 1611,
      "future": 1612,
      "www": 1613,
      "respons": 1614,
      "ahlstrom": 1615,
      "teliasonera": 1616,
      "32": 1617,
      "base": 1618,
      "bio": 1619,
      "back": 1620,
      "col": 1621,
      "cle": 1622,
      "ol": 1623,
      "park": 1624,
      "very": 1625,
      "##ky": 1626,
      "##onen": 1627,
      "##ants": 1628,
      "##edul": 1629,
      "##ction": 1630,
      "##ided": 1631,
      "stand": 1632,
      "##ection": 1633,
      "##istration": 1634,
      "recurring": 1635,
      "teleste": 1636,
      "handset": 1637,
      "public": 1638,
      "positive": 1639,
      "issued": 1640,
      "reduct": 1641,
      "schedul": 1642,
      "whole": 1643,
      "posted": 1644,
      "south": 1645,
      "estonia": 1646,
      "poyry": 1647,
      "govern": 1648,
      "43": 1649,
      "cli": 1650,
      "kes": 1651,
      "neste": 1652,
      "##uit": 1653,
      "##son": 1654,
      "##yc": 1655,
      "##ker": 1656,
      "infr": 1657,
      "##edn": 1658,
      "tool": 1659,
      "only": 1660,
      "online": 1661,
      "reach": 1662,
      "##ows": 1663,
      "att": 1664,
      "who": 1665,
      "priv": 1666,
      "chie": 1667,
      "held": 1668,
      "upon": 1669,
      "device": 1670,
      "index": 1671,
      "ago": 1672,
      "decision": 1673,
      "decided": 1674,
      "contracts": 1675,
      "secure": 1676,
      "corporate": 1677,
      "afx": 1678,
      "install": 1679,
      "flow": 1680,
      "subscrib": 1681,
      "glass": 1682,
      "application": 1683,
      "life": 1684,
      "materials": 1685,
      "received": 1686,
      "packaging": 1687,
      "passeng": 1688,
      "author": 1689,
      "infrast": 1690,
      "chief": 1691,
      "best": 1692,
      "call": 1693,
      "home": 1694,
      "mult": 1695,
      "merg": 1696,
      "sur": 1697,
      "sel": 1698,
      "wedn": 1699,
      "##com": 1700,
      "##50": 1701,
      "##kur": 1702,
      "##esday": 1703,
      "##ale": 1704,
      "any": 1705,
      "eur6": 1706,
      "##olid": 1707,
      "conn": 1708,
      "##ung": 1709,
      "sho": 1710,
      "requ": 1711,
      "operators": 1712,
      "income": 1713,
      "##ocomp": 1714,
      "content": 1715,
      "##ages": 1716,
      "using": 1717,
      "##isting": 1718,
      "adv": 1719,
      "##aston": 1720,
      "##luding": 1721,
      "web": 1722,
      "outotec": 1723,
      "consult": 1724,
      "consolid": 1725,
      "employs": 1726,
      "transport": 1727,
      "##ization": 1728,
      "large": 1729,
      "##ramo": 1730,
      "publish": 1731,
      "##ission": 1732,
      "aspocomp": 1733,
      "digital": 1734,
      "excluding": 1735,
      "logistics": 1736,
      "import": 1737,
      "scanfil": 1738,
      "##ources": 1739,
      "pohjola": 1740,
      "tonnes": 1741,
      "infrastructure": 1742,
      "wednesday": 1743,
      "56": 1744,
      "cramo": 1745,
      "econ": 1746,
      "fu": 1747,
      "five": 1748,
      "ge": 1749,
      "gas": 1750,
      "ha": 1751,
      "squ": 1752,
      "test": 1753,
      "tek": 1754,
      "wood": 1755,
      "yester": 1756,
      "##ti": 1757,
      "##ipping": 1758,
      "##fol": 1759,
      "##les": 1760,
      "##ink": 1761,
      "them": 1762,
      "inn": 1763,
      "##alm": 1764,
      "compr": 1765,
      "##ider": 1766,
      "fort": 1767,
      "##emical": 1768,
      "ship": 1769,
      "incap": 1770,
      "sek": 1771,
      "admin": 1772,
      "investors": 1773,
      "##ically": 1774,
      "manager": 1775,
      "making": 1776,
      "##ension": 1777,
      "technologies": 1778,
      "close": 1779,
      "published": 1780,
      "strategic": 1781,
      "taxes": 1782,
      "combined": 1783,
      "rapala": 1784,
      "##ause": 1785,
      "executive": 1786,
      "different": 1787,
      "government": 1788,
      "econom": 1789,
      "square": 1790,
      "yesterday": 1791,
      "39": 1792,
      "48": 1793,
      "49": 1794,
      "500": 1795,
      "ap": 1796,
      "but": 1797,
      "big": 1798,
      "bene": 1799,
      "dro": 1800,
      "house": 1801,
      "jap": 1802,
      "tec": 1803,
      "tam": 1804,
      "vent": 1805,
      "x20": 1806,
      "##ted": 1807,
      "##va": 1808,
      "struct": 1809,
      "beer": 1810,
      "shipping": 1811,
      "existing": 1812,
      "ald": 1813,
      "maxim": 1814,
      "maga": 1815,
      "##oci": 1816,
      "india": 1817,
      "managing": 1818,
      "provided": 1819,
      "acquire": 1820,
      "paid": 1821,
      "##ize": 1822,
      "elisa": 1823,
      "glaston": 1824,
      "consumers": 1825,
      "portfol": 1826,
      "partner": 1827,
      "activities": 1828,
      "ebit": 1829,
      "liqu": 1830,
      "established": 1831,
      "tikkur": 1832,
      "##metic": 1833,
      "germany": 1834,
      "details": 1835,
      "analysis": 1836,
      "respectively": 1837,
      "okmetic": 1838,
      "scheduled": 1839,
      "kesko": 1840,
      "magaz": 1841,
      "tikkurila": 1842,
      "46": 1843,
      "47": 1844,
      "cal": 1845,
      "dis": 1846,
      "er": 1847,
      "fish": 1848,
      "fall": 1849,
      "kon": 1850,
      "lic": 1851,
      "low": 1852,
      "ny": 1853,
      "nat": 1854,
      "sq": 1855,
      "site": 1856,
      "ten": 1857,
      "##ty": 1858,
      "##til": 1859,
      "##ful": 1860,
      "##bo": 1861,
      "##mark": 1862,
      "##get": 1863,
      "##inal": 1864,
      "##ross": 1865,
      "##ety": 1866,
      "forec": 1867,
      "operation": 1868,
      "operates": 1869,
      "super": 1870,
      "atria": 1871,
      "##raz": 1872,
      "covers": 1873,
      "chemical": 1874,
      "again": 1875,
      "brid": 1876,
      "phones": 1877,
      "owner": 1878,
      "return": 1879,
      "deliveries": 1880,
      "look": 1881,
      "facilities": 1882,
      "brands": 1883,
      "telecomm": 1884,
      "##mink": 1885,
      "funds": 1886,
      "property": 1887,
      "disclosed": 1888,
      "particip": 1889,
      "experience": 1890,
      "turk": 1891,
      "platform": 1892,
      "componenta": 1893,
      "innov": 1894,
      "benef": 1895,
      "aldata": 1896,
      "maximum": 1897,
      "portfolio": 1898,
      "90": 1899,
      "aust": 1900,
      "clo": 1901,
      "fil": 1902,
      "flex": 1903,
      "if": 1904,
      "lith": 1905,
      "lik": 1906,
      "nar": 1907,
      "tall": 1908,
      "tues": 1909,
      "way": 1910,
      "wind": 1911,
      "##to": 1912,
      "##ep": 1913,
      "##egr": 1914,
      "##ring": 1915,
      "##ranes": 1916,
      "##oint": 1917,
      "##par": 1918,
      "##kt": 1919,
      "thurs": 1920,
      "##aruukki": 1921,
      "##ited": 1922,
      "##itut": 1923,
      "##eless": 1924,
      "##eto": 1925,
      "prot": 1926,
      "##ideo": 1927,
      "##ecranes": 1928,
      "conver": 1929,
      "asia": 1930,
      "##imek": 1931,
      "operator": 1932,
      "marimek": 1933,
      "enable": 1934,
      "cour": 1935,
      "##aces": 1936,
      "##okump": 1937,
      "resources": 1938,
      "move": 1939,
      "offers": 1940,
      "##ption": 1941,
      "meat": 1942,
      "outokump": 1943,
      "developing": 1944,
      "integr": 1945,
      "##ught": 1946,
      "closed": 1947,
      "planning": 1948,
      "located": 1949,
      "generated": 1950,
      "stores": 1951,
      "associ": 1952,
      "electronic": 1953,
      "improv": 1954,
      "improve": 1955,
      "consumer": 1956,
      "poland": 1957,
      "rautaruukki": 1958,
      "tieto": 1959,
      "team": 1960,
      "restruct": 1961,
      "listed": 1962,
      "subscription": 1963,
      "lemmink": 1964,
      "treat": 1965,
      "fortum": 1966,
      "tecn": 1967,
      "konecranes": 1968,
      "natural": 1969,
      "lithuan": 1970,
      "tuesday": 1971,
      "thursday": 1972,
      "marimekko": 1973,
      "outokumpu": 1974,
      "42": 1975,
      "55": 1976,
      "57": 1977,
      "51": 1978,
      "alex": 1979,
      "bre": 1980,
      "bond": 1981,
      "kone": 1982,
      "lond": 1983,
      "mor": 1984,
      "nas": 1985,
      "nav": 1986,
      "sk": 1987,
      "video": 1988,
      "win": 1989,
      "went": 1990,
      "##uch": 1991,
      "##ef": 1992,
      "##aara": 1993,
      "##bank": 1994,
      "##hod": 1995,
      "##ann": 1996,
      "##arily": 1997,
      "##ases": 1998,
      "##eld": 1999,
      "##ters": 2000,
      "she": 2001,
      "within": 2002,
      "##artment": 2003,
      "businesses": 2004,
      "##ounts": 2005,
      "offic": 2006,
      "book": 2007,
      "##thern": 2008,
      "technop": 2009,
      "makes": 2010,
      "providing": 2011,
      "##ove": 2012,
      "bring": 2013,
      "raw": 2014,
      "included": 2015,
      "199": 2016,
      "continued": 2017,
      "##holm": 2018,
      "estimates": 2019,
      "arr": 2020,
      "options": 2021,
      "##mmene": 2022,
      "improved": 2023,
      "talv": 2024,
      "become": 2025,
      "because": 2026,
      "##daq": 2027,
      "kymmene": 2028,
      "slight": 2029,
      "versus": 2030,
      "clear": 2031,
      "structures": 2032,
      "narrow": 2033,
      "restructuring": 2034,
      "alexand": 2035,
      "london": 2036,
      "nasdaq": 2037,
      "41": 2038,
      "53": 2039,
      "dom": 2040,
      "fair": 2041,
      "har": 2042,
      "il": 2043,
      "mus": 2044,
      "nn": 2045,
      "ple": 2046,
      "ru": 2047,
      "ram": 2048,
      "sat": 2049,
      "vess": 2050,
      "##cement": 2051,
      "##aht": 2052,
      "##aja": 2053,
      "##other": 2054,
      "##band": 2055,
      "##ination": 2056,
      "another": 2057,
      "##urement": 2058,
      "##asing": 2059,
      "##isio": 2060,
      "##irent": 2061,
      "alt": 2062,
      "suc": 2063,
      "contain": 2064,
      "##ably": 2065,
      "upgr": 2066,
      "##ards": 2067,
      "offs": 2068,
      "bought": 2069,
      "investor": 2070,
      "consider": 2071,
      "##ensive": 2072,
      "build": 2073,
      "metal": 2074,
      "method": 2075,
      "prem": 2076,
      "divest": 2077,
      "planned": 2078,
      "additional": 2079,
      "cargo": 2080,
      "liters": 2081,
      "properties": 2082,
      "entire": 2083,
      "espoo": 2084,
      "temporary": 2085,
      "printing": 2086,
      "segment": 2087,
      "recently": 2088,
      "summer": 2089,
      "broadband": 2090,
      "enables": 2091,
      "tekla": 2092,
      "administration": 2093,
      "venture": 2094,
      "x20ac": 2095,
      "bridge": 2096,
      "telecommunic": 2097,
      "37": 2098,
      "300": 2099,
      "65": 2100,
      "braz": 2101,
      "cir": 2102,
      "cert": 2103,
      "den": 2104,
      "date": 2105,
      "fisc": 2106,
      "gain": 2107,
      "hy": 2108,
      "hous": 2109,
      "just": 2110,
      "mos": 2111,
      "os": 2112,
      "run": 2113,
      "rout": 2114,
      "sil": 2115,
      "tex": 2116,
      "vis": 2117,
      "vac": 2118,
      "vice": 2119,
      "wir": 2120,
      "##uing": 2121,
      "##ii": 2122,
      "##iev": 2123,
      "##amp": 2124,
      "##bt": 2125,
      "##by": 2126,
      "##mb": 2127,
      "##ying": 2128,
      "##house": 2129,
      "##gest": 2130,
      "##ws": 2131,
      "##inc": 2132,
      "##ints": 2133,
      "##orp": 2134,
      "##ories": 2135,
      "##rod": 2136,
      "##aly": 2137,
      "##omm": 2138,
      "##ential": 2139,
      "structure": 2140,
      "##emens": 2141,
      "##ivaara": 2142,
      "##ected": 2143,
      "change": 2144,
      "##berg": 2145,
      "users": 2146,
      "##look": 2147,
      "adj": 2148,
      "expans": 2149,
      "syn": 2150,
      "outlook": 2151,
      "monday": 2152,
      "stockholm": 2153,
      "points": 2154,
      "raisio": 2155,
      "impact": 2156,
      "few": 2157,
      "electric": 2158,
      "working": 2159,
      "growing": 2160,
      "announcement": 2161,
      "newspa": 2162,
      "machines": 2163,
      "country": 2164,
      "france": 2165,
      "institut": 2166,
      "vaaht": 2167,
      "fully": 2168,
      "patent": 2169,
      "trading": 2170,
      "below": 2171,
      "establish": 2172,
      "##astern": 2173,
      "carried": 2174,
      "efficiency": 2175,
      "automation": 2176,
      "stream": 2177,
      "assets": 2178,
      "beginning": 2179,
      "siemens": 2180,
      "responsible": 2181,
      "clients": 2182,
      "tools": 2183,
      "private": 2184,
      "subscribed": 2185,
      "liquid": 2186,
      "magazine": 2187,
      "arrang": 2188,
      "talvivaara": 2189,
      "ramirent": 2190,
      "telecommunications": 2191,
      "brazil": 2192,
      "circ": 2193,
      "fiscal": 2194,
      "expansion": 2195,
      "newspaper": 2196,
      "vaahto": 2197,
      "01": 2198,
      "34": 2199,
      "44": 2200,
      "74": 2201,
      "75": 2202,
      "bi": 2203,
      "bar": 2204,
      "cenc": 2205,
      "gu": 2206,
      "hon": 2207,
      "lab": 2208,
      "national": 2209,
      "pot": 2210,
      "right": 2211,
      "var": 2212,
      "##ier": 2213,
      "##ress": 2214,
      "##co": 2215,
      "##ou": 2216,
      "##less": 2217,
      "##lined": 2218,
      "##gian": 2219,
      "##wide": 2220,
      "##erning": 2221,
      "##ending": 2222,
      "top": 2223,
      "##ists": 2224,
      "##isala": 2225,
      "prom": 2226,
      "eur7": 2227,
      "forward": 2228,
      "##olis": 2229,
      "stud": 2230,
      "##oski": 2231,
      "operational": 2232,
      "##ody": 2233,
      "invol": 2234,
      "above": 2235,
      "northern": 2236,
      "space": 2237,
      "##ified": 2238,
      "commission": 2239,
      "industries": 2240,
      "reporting": 2241,
      "agreements": 2242,
      "##ences": 2243,
      "jobs": 2244,
      "machine": 2245,
      "complete": 2246,
      "persons": 2247,
      "negative": 2248,
      "##ostaja": 2249,
      "model": 2250,
      "vaisala": 2251,
      "latv": 2252,
      "latest": 2253,
      "communication": 2254,
      "aims": 2255,
      "concerning": 2256,
      "mainly": 2257,
      "digia": 2258,
      "raute": 2259,
      "holdings": 2260,
      "know": 2261,
      "known": 2262,
      "suomen": 2263,
      "changes": 2264,
      "panostaja": 2265,
      "bioh": 2266,
      "installation": 2267,
      "connect": 2268,
      "shopping": 2269,
      "consolidated": 2270,
      "treatment": 2271,
      "slightly": 2272,
      "alexandria": 2273,
      "adjust": 2274,
      "cencorp": 2275,
      "400": 2276,
      "52": 2277,
      "bid": 2278,
      "dil": 2279,
      "ever": 2280,
      "fig": 2281,
      "given": 2282,
      "hu": 2283,
      "hot": 2284,
      "jy": 2285,
      "lines": 2286,
      "mic": 2287,
      "name": 2288,
      "pension": 2289,
      "rad": 2290,
      "rise": 2291,
      "##ta": 2292,
      "##side": 2293,
      "##0m": 2294,
      "##red": 2295,
      "##comp": 2296,
      "##val": 2297,
      "##put": 2298,
      "##gn": 2299,
      "##jo": 2300,
      "##eries": 2301,
