{
  "''": 30523,
  "'re": 30652,
  "'s": 30524,
  "+358": 30580,
  "+àland": 30752,
  ",000": 30618,
  "--": 30539,
  "-¦": 30844,
  ".0": 30763,
  ".1": 30662,
  ".12": 30790,
  ".2": 30571,
  ".3": 30541,
  ".4": 30626,
  ".5": 30564,
  ".6": 30540,
  ".7": 30719,
  ".8": 30627,
  ".9": 30660,
  "0.1": 30767,
  "0.2": 30608,
  "0.21": 30817,
  "0.3": 30799,
  "0.33": 30561,
  "0.50": 30755,
  "0.6": 30816,
  "0.8": 30609,
  "0.9": 30798,
  "1,000": 30800,
  "1.0": 30825,
  "1.1": 30590,
  "1.2": 30756,
  "1.3": 30612,
  "1.5": 30645,
  "1.7": 30594,
  "10,000": 30815,
  "100,000": 30801,
  "12-month": 30637,
  "13.5": 30859,
  "2.0": 30849,
  "2.2": 30688,
  "2.3": 30692,
  "2.5": 30664,
  "2.6": 30840,
  "2.7": 30555,
  "2.8": 30824,
  "3.0": 30647,
  "3.1": 30797,
  "3.3": 30781,
  "3.4": 30616,
  "3.5": 30658,
  "3.6": 30823,
  "3.8": 30624,
  "3G": 30777,
  "4.0": 30556,
  "4.1": 30843,
  "4.5": 30620,
  "4.6": 30711,
  "4.7": 30754,
  "400,000": 30639,
  "5.1": 30832,
  "5.2": 30615,
  "5.4": 30786,
  "5.5": 30716,
  "6.1": 30858,
  "6.3": 30814,
  "7.4": 30775,
  "8.3": 30842,
  "8.4": 30708,
  "9.7": 30699,
  "A.": 30684,
  "ADP": 30596,
  "ADPnews": 30848,
  "AFX": 30582,
  "Abp": 30741,
  "Affecto": 30693,
  "Ahlstrom": 30527,
  "Aker": 30724,
  "Aktia": 30758,
  "Aldata": 30569,
  "Amer": 30765,
  "April-June": 30839,
  "Aspo": 30710,
  "Aspocomp": 30714,
  "Atria": 30828,
  "Barclays": 30644,
  "BasWare": 30833,
  "Basware": 30525,
  "Bavelloni": 30850,
  "Benefon": 30827,
  "Biohit": 30787,
  "CapMan": 30698,
  "Cargotec": 30702,
  "Cencorp": 30570,
  "Citycon": 30559,
  "Co.": 30602,
  "Componenta": 30545,
  "Comptel": 30729,
  "Corp.": 30636,
  "Cramo": 30675,
  "Cybercom": 30845,
  "Danske": 30854,
  "Dec.": 30778,
  "Digia": 30641,
  "Diluted": 30803,
  "EB": 30785,
  "EBIT": 30745,
  "EBITDA": 30747,
  "EEK": 30738,
  "EET": 30574,
  "EUR": 30536,
  "EUR0": 30665,
  "EUR1": 30762,
  "EUR10": 30838,
  "EUR13": 30749,
  "EUR15": 30661,
  "EUR2": 30625,
  "EUR3": 30819,
  "EUR4": 30572,
  "EUR5": 30619,
  "EUR6": 30670,
  "EUR7": 30668,
  "Eesti": 30774,
  "Efore": 30542,
  "Elcoteq": 30529,
  "Enso": 30674,
  "Espoo": 30726,
  "Exel": 30761,
  "F-Secure": 30735,
  "FTSE": 30802,
  "Finland-based": 30649,
  "Finnair": 30605,
  "Finnlines": 30584,
  "Fiskars": 30544,
  "Fortum": 30604,
  "GeoSentric": 30821,
  "Glaston": 30788,
  "Grimaldi": 30583,
  "GyPSii": 30537,
  "HEL": 30598,
  "HKScan": 30535,
  "Hamina": 30603,
  "Hannu": 30740,
  "Heikki": 30672,
  "Honkarakenne": 30789,
  "Huhtamaki": 30769,
  "Inc.": 30575,
  "Incap": 30632,
  "Invoice": 30856,
  "Ixonos": 30623,
  "Jan.": 30727,
  "January-June": 30846,
  "January-March": 30634,
  "January-September": 30669,
  "Juha": 30685,
  "July-September": 30538,
  "Jussi": 30771,
  "Jyvaskyla": 30837,
  "KCI": 30793,
  "KONE": 30578,
  "Kalmar": 30591,
  "Kaupthing": 30725,
  "Kemira": 30694,
  "Kesko": 30643,
  "Kone": 30723,
  "Konecranes": 30622,
  "L+ñnnen": 30794,
  "LEM1S": 30687,
  "LTE": 30805,
  "Lassila": 30835,
  "Lemminkainen": 30686,
  "Ls": 30642,
  "Ltd.": 30730,
  "M-real": 30551,
  "MEUR": 30558,
  "Marimekko": 30707,
  "Martela": 30671,
  "Matti": 30655,
  "Metsaliitto": 30549,
  "Metso": 30607,
  "Mr.": 30739,
  "NASDAQ": 30581,
  "NDA": 30831,
  "NOK": 30796,
  "NYSE": 30648,
  "Nastola": 30779,
  "Neomarkka": 30857,
  "Neste": 30656,
  "Nokian": 30852,
  "Nordea": 30548,
  "Nordstjernan": 30792,
  "OKO": 30567,
  "OMX": 30560,
  "OYJ": 30784,
  "Oct.": 30683,
  "Okmetic": 30667,
  "Olvi": 30610,
  "Oriola-KD": 30783,
  "Oulu": 30772,
  "Outokumpu": 30587,
  "Outotec": 30565,
  "Oy": 30630,
  "Oyj": 30589,
  "PKC": 30807,
  "Panostaja": 30599,
  "Plc.": 30822,
  "Pohjola": 30650,
  "Ponsse": 30601,
  "Poyry": 30720,
  "Pretax": 30728,
  "Q1": 30813,
  "QPR": 30776,
  "R&D": 30659,
  "RTRKS": 30806,
  "Raisio": 30635,
  "Ramirent": 30600,
  "Rapala": 30543,
  "Rautaruukki": 30760,
  "Raute": 30588,
  "Ruokatalo": 30773,
  "Ruukki": 30547,
  "SEK": 30679,
  "SSH": 30757,
  "STO": 30782,
  "Salcomp": 30712,
  "Sampo": 30709,
  "Sanoma": 30617,
  "Sappi": 30705,
  "Satama": 30638,
  "Savcor": 30715,
  "Scanfil": 30732,
  "Sentera": 30690,
  "Seppala": 30853,
  "Solidium": 30703,
  "Solteq": 30676,
  "Sponda": 30566,
  "St.": 30701,
  "Stockmann": 30533,
  "StoneGate": 30613,
  "Stonesoft": 30611,
  "Stora": 30673,
  "Suomen": 30706,
  "Suominen": 30737,
  "Symbian": 30811,
  "SysOpen": 30691,
  "TLT1V": 30697,
  "Talentum": 30753,
  "Talvivaara": 30768,
  "Tampere": 30552,
  "Technopolis": 30531,
  "Tecnomen": 30829,
  "Tecnotree": 30586,
  "Tehtaat": 30795,
  "Tekla": 30746,
  "Teleste": 30696,
  "TeliaSonera": 30742,
  "Tieto": 30750,
  "TietoEnator": 30678,
  "Tiimari": 30554,
  "Tikanoja": 30836,
  "Tikkurila": 30704,
  "Timo": 30577,
  "Tulikivi": 30809,
  "Turku": 30734,
  "U.S.": 30743,
  "UPM": 30550,
  "UPM-Kymmene": 30651,
  "US$": 30808,
  "Uponor": 30631,
  "VMC": 30597,
  "Va.": 30682,
  "Vaahto": 30528,
  "Vacon": 30721,
  "Vaisala": 30593,
  "Vantaa": 30791,
  "WCDMA": 30640,
  "Wartsila": 30532,
  "YIT": 30621,
  "``": 30522,
  "a.m.": 30722,
  "benchmark": 30573,
  "biodiesel": 30653,
  "bln": 30595,
  "brand-new": 30820,
  "buyout": 30700,
  "charger": 30713,
  "coatings": 30766,
  "competitiveness": 30851,
  "divested": 30677,
  "divestment": 30680,
  "dividend": 30628,
  "dividends": 30663,
  "e-mail": 30764,
  "employer-employee": 30826,
  "end-to-end": 30629,
  "escalators": 30847,
  "eur": 30534,
  "forecasts": 30751,
  "full-year": 30717,
  "handset": 30568,
  "high-quality": 30657,
  "invoice": 30681,
  "invoices": 30834,
  "know-how": 30841,
  "kroons": 30860,
  "lay-offs": 30592,
  "layoffs": 30530,
  "licences": 30759,
  "liters": 30689,
  "long-term": 30526,
  "m.": 30606,
  "mln": 30557,
  "n't": 30576,
  "non-recurring": 30585,
  "p.m.": 30633,
  "pct": 30562,
  "plywood": 30646,
  "pre-tax": 30546,
  "prepaid": 30830,
  "pretax": 30744,
  "profitability": 30818,
  "salaried": 30855,
  "second-quarter": 30733,
  "six-month": 30748,
  "specialises": 30553,
  "streamline": 30654,
  "strengthens": 30731,
  "subscribed": 30718,
  "subscriptions": 30736,
  "tel.": 30579,
  "three-month": 30770,
  "tm": 30810,
  "totalled": 30614,
  "veneer": 30780,
  "wafer": 30666,
  "wafers": 30812,
  "webcast": 30804,
  "x20ac": 30695,
  "year-on-year": 30563
}
